graffitiapp/app/controllers/images_controller.rb

UPDATE "murals" SET "images" = $1, "updated_at" = $2 WHERE "murals"."id" = $3  [["images", "{windows3.png}"], ["updated_at", "2017-07-03 22:10:38.112912"], ["id", 3]]
---
  def create
    add_more_images(images_params[:images])
    flash[:error] = "Failed uploading images" unless @mural.save

SELECT  "murals".* FROM "murals" WHERE "murals"."id" = $1 LIMIT $2  [["id", 3], ["LIMIT", 1]]
---
  def set_mural
    @mural = Mural.find(params[:mural_id])