graffitiapp/app/controllers/murals_controller.rb

SELECT "murals".* FROM "murals"
---
	def index
		@murals = Mural.all

INSERT INTO "murals" ("created_at", "updated_at", "lat", "long", "images", "artist", "year") VALUES ($1, $2, $3, $4, $5, $6, $7) RETURNING "id"
---
	def create
		@mural = Mural.new(mural_params)

		 if @mural.save

SELECT  "murals".* FROM "murals" WHERE "murals"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
	def find_mural
		@mural = Mural.find(params[:id])